/**
 * *****************************************************************************
 * @file    bsp_mcu.h
 * @brief   mcu 模块头文件
 * *****************************************************************************
 */

/** Define to prevent recursive inclusion ----------------------------------- */
#ifndef __BSP_MCU_H
#define __BSP_MCU_H

#ifdef __cplusplus
    extern "C" {
#endif

/** Includes ---------------------------------------------------------------- */
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"

#ifndef BSP_MCU_EN
    #define BSP_MCU_EN              1
#endif
#if (BSP_MCU_EN)

/** Defines ----------------------------------------------------------------- */

/** Types ------------------------------------------------------------------- */

/** Variables --------------------------------------------------------------- */

/** Functions --------------------------------------------------------------- */
int bsp_mcu_init(void);
void bsp_mcu_irq_enable(void);
void bsp_mcu_irq_disable(void);

/** ------------------------------------------------------------------------- */
#endif  /* BSP_MCU_EN */

#ifdef __cplusplus
    }
#endif

#endif  /* __BSP_MCU_H */

/******************************* (END OF FILE) ********************************/
